Mod-3/Week-1/lecture-3-rails-crud/ending-code/study-group-sushi/app/controllers/sushis_controller.rb

    def index
      @sushis = Sushi.all
---
SELECT "sushis".* FROM "sushis"

    def create
      binding.pry
      @sushi = Sushi.new(sushi_params)
      if @sushi.save
---
INSERT INTO "sushis" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Poke Roll"], ["created_at", "2020-10-15 15:27:56.912533"], ["updated_at", "2020-10-15 15:27:56.912533"]]

    def update
      if @sushi
        @sushi.update(sushi_params)
---
UPDATE "sushis" SET "name" = ?, "updated_at" = ? WHERE "sushis"."id" = ?  [["name", "Ocho Cinco Roe Roll"], ["updated_at", "2020-10-15 15:46:54.615404"], ["id", 2]]

    def destroy
      @sushi.destroy
---
DELETE FROM "sushis" WHERE "sushis"."id" = ?  [["id", 2]]

    def set_sushi
      @sushi = Sushi.find_by_id(params[:id])
---
SELECT  "sushis".* FROM "sushis" WHERE "sushis"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]