Mod-3/Week-1/lecture-1-intro-to-rails/ending-code/tourist-app/app/controllers/tours_controller.rb

  def index
    @tours = Tour.all
---
SELECT "tours".* FROM "tours"

  def create
    @tour = Tour.new(tour_params)
    if @tour.save
---
INSERT INTO "tours" ("name", "location", "activities", "cost", "start_time", "end_time", "tour_date", "full", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
      if @tour.update(tour_params)
---
UPDATE "tours" SET "cost" = ?, "updated_at" = ? WHERE "tours"."id" = ?  [["cost", 200.0], ["updated_at", "2020-10-13 15:30:10.527450"], ["id", 1]]

  def destroy
    @tour.destroy
---
DELETE FROM "tours" WHERE "tours"."id" = ?  [["id", 1]]

    def set_tour
      @tour = Tour.find(params[:id])
---
SELECT "tours".* FROM "tours" WHERE "tours"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]