Mod-3/Week-1/lecture-1-intro-to-rails/ending-code/tourist-app/app/views/tours/show.html.erb

  <strong>Tourists:</strong>
  <% @tour.tourists.each do |tourist| %>
---
SELECT "tourists".* FROM "tourists" WHERE "tourists"."tour_id" = ?  [["tour_id", 2]]